# Задача 1. Вычислить число c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

import math
d = input('Введите точность: ')

d = str(d)
len_d = len(d) - 2
print(f"pi = {math.pi:.{len_d}f}")


pi= 3,14159265
